using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;

namespace Drag_AND_Drop_between_Forms
{
    public partial class CalculoCondensador : Form
    {
        //Matriz de Coeficientes de Transferencia de Calor
        Double[,] U = new Double[6, 19];
        //Matriz de Factores de corrección por Temperatura de Agua de Circulación
        Double[] Fw=new Double[90];
        //Matriz de Factores de corrección por Tipo de Material
        Double[,] Fm=new Double[14,9];

        //Falta definir una función de Interpolación Doble

        public CalculoCondensador()
        {
            //Inicialización de la matriz U-Coeficientes de Transferencia de Calor (Diámetro tubo,Velocidad en tubo).
            //Unidades: U(BTU/(Hr x ft^2 x ºF)) ; Tube Velocity (ft/sg)  ; Tube Diameter (inches)
            //Tube Velocity 3.0 
            U[0, 0] = 462.5;
            U[1, 0] = 455;
            U[2, 0] = 448.6;
            U[3, 0] = 441.7;
            U[4, 0] = 434.7;
            U[5, 0] = 427.8;

            //Tube Velocity 3.5 
            U[0, 1] = 499.5;
            U[1, 1] = 492;
            U[2, 1] = 484.5;
            U[3, 1] = 477.1;
            U[4, 1] = 469.6;
            U[5, 1] = 462.1;

            //Tube Velocity 4.0 
            U[0, 2] = 534;
            U[1, 2] = 526;
            U[2, 2] = 518;
            U[3, 2] = 510;
            U[4, 2] = 502;
            U[5, 2] = 494;

            //Tube Velocity 4.5 
            U[0, 3] = 566.4;
            U[1, 3] = 557.9;
            U[2, 3] = 549.4;
            U[3, 3] = 540.9;
            U[4, 3] = 532.5;
            U[5, 3] = 524;

            //Tube Velocity 5.0 
            U[0, 4] = 597;
            U[1, 4] = 588.1;
            U[2, 4] = 579.1;
            U[3, 4] = 570.2;
            U[4, 4] = 561.3;
            U[5, 4] = 552.3;

            //Tube Velocity 5.5
            U[0, 5] = 626.2;
            U[1, 5] = 616.8;
            U[2, 5] = 607.4;
            U[3, 5] = 598;
            U[4, 5] = 588.6;
            U[5, 5] = 579.8;

            //Tube Velocity 6.0
            U[0, 6] = 654;
            U[1, 6] = 644.2;
            U[2, 6] = 634.4;
            U[3, 6] = 624.6;
            U[4, 6] = 614.8;
            U[5, 6] = 605;

            //Tube Velocity 6.5
            U[0, 7] = 680.7;
            U[1, 7] = 670.5;
            U[2, 7] = 660.3;
            U[3, 7] = 650.1;
            U[4, 7] = 639.9;
            U[5, 7] = 629.7;

            //Tube Velocity 7.0
            U[0, 8] = 706.4;
            U[1, 8] = 695.8;
            U[2, 8] = 685.2;
            U[3, 8] = 674.7;
            U[4, 8] = 664.1;
            U[5, 8] = 653.5;

            //Tube Velocity 7.5
            U[0, 9] = 731.2;
            U[1, 9] = 720.3;
            U[2, 9] = 709.3;
            U[3, 9] = 698.3;
            U[4, 9] = 687.4;
            U[5, 9] = 676.4;

            //Tube Velocity 8.0
            U[0, 10] = 755.2;
            U[1, 10] = 743.9;
            U[2, 10] = 732.6;
            U[3, 10] = 721.2;
            U[4, 10] = 709.9;
            U[5, 10] = 698.6;

            //Tube Velocity 8.5
            U[0, 11] = 775.5;
            U[1, 11] = 763.9;
            U[2, 11] = 752;
            U[3, 11] = 740.4;
            U[4, 11] = 727.8;
            U[5, 11] = 716.8;

            //Tube Velocity 9.0
            U[0, 12] = 795.3;
            U[1, 12] = 783.2;
            U[2, 12] = 770.7;
            U[3, 12] = 758.7;
            U[4, 12] = 745.7;
            U[5, 12] = 734.4;

            //Tube Velocity 9.5
            U[0, 13] = 814.1;
            U[1, 13] = 801.6;
            U[2, 13] = 788.4;
            U[3, 13] = 776.1;
            U[4, 13] = 762.7;
            U[5, 13] = 751.0;

            //Tube Velocity 10.0
            U[0, 14] = 831.9;
            U[1, 14] = 819;
            U[2, 14] = 805.3;
            U[3, 14] = 792.6;
            U[4, 14] = 778.8;
            U[5, 14] = 766.8;

            //Tube Velocity 10.5
            U[0, 15] = 848.9;
            U[1, 15] = 835.6;
            U[2, 15] = 821.4;
            U[3, 15] = 808.3;
            U[4, 15] = 794.1;
            U[5, 15] = 781.8;

            //Tube Velocity 11.0
            U[0, 16] = 865.2;
            U[1, 16] = 851.5;
            U[2, 16] = 836.7;
            U[3, 16] = 823.2;
            U[4, 16] = 808.8;
            U[5, 16] = 796.2;

            //Tube Velocity 11.5
            U[0, 17] = 880.7;
            U[1, 17] = 866.6;
            U[2, 17] = 851.3;
            U[3, 17] = 837.5;
            U[4, 17] = 822.7;
            U[5, 17] = 809.8;

            //Tube Velocity 12.0
            U[0, 18] = 895.6;
            U[1, 18] = 881.1;
            U[2, 18] = 865.3;
            U[3, 18] = 851.2;
            U[4, 18] = 836;
            U[5, 18] = 822.9;


            //Inicialización de la matriz de Coeficientes de Temperatura Fw
            //Unidades: Inlet Water (ºF)

            Fw[0] = 0.650;
            Fw[1] = 0.659;
            Fw[2] = 0.669;
            Fw[3] = 0.678;
            Fw[4] = 0.687;
            Fw[5] = 0.696;
            Fw[6] = 0.706;
            Fw[7] = 0.715;
            Fw[8] = 0.724;
            Fw[9] = 0.733;
            Fw[10] = 0.743;
            Fw[11] = 0.752;
            Fw[12] = 0.761;
            Fw[13] = 0.770;
            Fw[14] = 0.780;
            Fw[15] = 0.789;
            Fw[16] = 0.798;
            Fw[17] = 0.807;
            Fw[18] = 0.816;
            Fw[19] = 0.825;
            Fw[20] = 0.834;
            Fw[21] = 0.843;
            Fw[22] = 0.852;
            Fw[23] = 0.861;
            Fw[24] = 0.870;
            Fw[25] = 0.879;
            Fw[26] = 0.888;
            Fw[27] = 0.897;
            Fw[28] = 0.905;
            Fw[29] = 0.914;

            Fw[30] = 0.923;
            Fw[31] = 0.932;
            Fw[32] = 0.941;
            Fw[33] = 0.950;
            Fw[34] = 0.959;
            Fw[35] = 0.968;
            Fw[36] = 0.975;
            Fw[37] = 0.982;
            Fw[38] = 0.989;
            Fw[39] = 0.994;
            Fw[40] = 1.00;
            Fw[41] = 1.005;
            Fw[42] = 1.010;
            Fw[43] = 1.015;
            Fw[44] = 1.020;
            Fw[45] = 1.025;
            Fw[46] = 1.029;
            Fw[47] = 1.033;
            Fw[48] = 1.037;
            Fw[49] = 1.041;
            Fw[50] = 1.045;
            Fw[51] = 1.048;
            Fw[52] = 1.051;
            Fw[53] = 1.054;
            Fw[54] = 1.057;
            Fw[55] = 1.060;
            Fw[56] = 1.063;
            Fw[57] = 1.066;
            Fw[58] = 1.069;
            Fw[59] = 1.072;

            Fw[60] = 1.075;
            Fw[61] = 1.078;
            Fw[62] = 1.080;
            Fw[63] = 1.083;
            Fw[64] = 1.085;
            Fw[65] = 1.088;
            Fw[66] = 1.090;
            Fw[67] = 1.092;
            Fw[68] = 1.095;
            Fw[69] = 1.097;
            Fw[70] = 1.100;
            Fw[71] = 1.103;
            Fw[72] = 1.105;
            Fw[73] = 1.108;
            Fw[74] = 1.110;
            Fw[75] = 1.113;
            Fw[76] = 1.115;
            Fw[77] = 1.117;
            Fw[77] = 1.119;
            Fw[78] = 1.121;
            Fw[80] = 1.123;
            Fw[81] = 1.125;
            Fw[82] = 1.127;
            Fw[83] = 1.129;
            Fw[84] = 1.131;
            Fw[85] = 1.133;
            Fw[86] = 1.135;
            Fw[87] = 1.137;
            Fw[88] = 1.139;
            Fw[89] = 1.141;
            Fw[90] = 1.143;
            
            //Inicialización de la matriz de Coeficientes de Corrección por tipo de material
            //Unidades: Tipo de Material; Espesor de Tubos (BWG)

            //Espesor Tubos BWG 25
            Fm[0,0]=1.03;
            Fm[1,0]=1.04;
            Fm[2,0]=1.04;
            Fm[3,0]=1.03;
            Fm[4, 0] = 1.02;
            Fm[5, 0] = 1.00;
            Fm[6, 0] = 0.97;
            Fm[7, 0] = 1.00;
            Fm[8, 0] = 0.91;
            Fm[9, 0] = 0.95;
            Fm[10, 0] = 0.90;
            Fm[11, 0] = 0.95;
            Fm[12, 0] = 0.93;
            Fm[13, 0] = 0.93;

            //Espesor Tubos BWG 24
            Fm[0, 1] = 1.03;
            Fm[1, 1] = 1.04;
            Fm[2, 1] = 1.04;
            Fm[3, 1] = 1.02;
            Fm[4, 1] = 1.02;
            Fm[5, 1] = 0.99;
            Fm[6, 1] = 0.97;
            Fm[7, 1] = 1.00;
            Fm[8, 1] = 0.90;
            Fm[9, 1] = 0.94;
            Fm[10, 1] =0.89;
            Fm[11, 1] =0.94;
            Fm[12, 1] =0.91;
            Fm[13, 1] =0.91;

            //Espesor Tubos BWG 23
            Fm[0, 2] = 1.02;
            Fm[1, 2] = 1.04;
            Fm[2, 2] = 1.04;
            Fm[3, 2] = 1.02;
            Fm[4, 2] = 1.01;
            Fm[5, 2] = 0.99;
            Fm[6, 2] = 0.96;
            Fm[7, 2] = 0.99;
            Fm[8, 2] = 0.88;
            Fm[9, 2] = 0.92;
            Fm[10, 2] =0.87;
            Fm[11, 2] =0.92;
            Fm[12, 2] =0.90;
            Fm[13, 2] =0.90;

            //Espesor Tubos BWG 22
            Fm[0, 3] = 1.02;
            Fm[1, 3] = 1.03;
            Fm[2, 3] = 1.04;
            Fm[3, 3] = 1.02;
            Fm[4, 3] = 1.01;
            Fm[5, 3] = 0.98;
            Fm[6, 3] = 0.95;
            Fm[7, 3] = 0.98;
            Fm[8, 3] = 0.86;
            Fm[9, 3] = 0.91;
            Fm[10, 3] =0.85;
            Fm[11, 3] =0.91;
            Fm[12, 3] =0.88;
            Fm[13, 3] =0.88;

            //Espesor Tubos BWG 20
            Fm[0, 4] = 1.01;
            Fm[1, 4] = 1.03;
            Fm[2, 4] = 1.03;
            Fm[3, 4] = 1.01;
            Fm[4, 4] = 1.00;
            Fm[5, 4] = 0.96;
            Fm[6, 4] = 0.92;
            Fm[7, 4] = 0.97;
            Fm[8, 4] = 0.82;
            Fm[9, 4] = 0.88;
            Fm[10, 4] = 0.81;
            Fm[11, 4] = 0.88;
            Fm[12, 4] = 0.85;
            Fm[13, 4] = 0.85;

            //Espesor Tubos BWG 18
            Fm[0, 5] = 1.00;
            Fm[1, 5] = 1.02;
            Fm[2, 5] = 1.03;
            Fm[3, 5] = 0.99;
            Fm[4, 5] = 0.98;
            Fm[5, 5] = 0.93;
            Fm[6, 5] = 0.88;
            Fm[7, 5] = 0.93;
            Fm[8, 5] = 0.75;
            Fm[9, 5] = 0.82;
            Fm[10, 5] = 0.74;
            Fm[11, 5] = 0.82;
            Fm[12, 5] = 0.78;
            Fm[13, 5] = 0.78;

            //Espesor Tubos BWG 16
            Fm[0, 6] = 0.98;
            Fm[1, 6] = 1.01;
            Fm[2, 6] = 1.02;
            Fm[3, 6] = 0.97;
            Fm[4, 6] = 0.96;
            Fm[5, 6] = 0.89;
            Fm[6, 6] = 0.83;
            Fm[7, 6] = 0.89;
            Fm[8, 6] = 0.69;
            Fm[9, 6] = 0.77;
            Fm[10, 6] = 0.67;
            Fm[11, 6] = 0.77;
            Fm[12, 6] = 0.72;
            Fm[13, 6] = 0.72;

            //Espesor Tubos BWG 14
            Fm[0, 7] = 0.96;
            Fm[1, 7] = 1.00;
            Fm[2, 7] = 1.01;
            Fm[3, 7] = 0.95;
            Fm[4, 7] = 0.93;
            Fm[5, 7] = 0.85;
            Fm[6, 7] = 0.78;
            Fm[7, 7] = 0.85;
            Fm[8, 7] = 0.62;
            Fm[9, 7] = 0.71;
            Fm[10, 7] = 0.60;
            Fm[11, 7] = 0.71;
            Fm[12, 7] = 0.65;
            Fm[13, 7] = 0.65;

            //Espesor Tubos BWG 12
            Fm[0, 8] = 0.93;
            Fm[1, 8] = 0.98;
            Fm[2, 8] = 1.00;
            Fm[3, 8] = 0.92;
            Fm[4, 8] = 0.89;
            Fm[5, 8] = 0.80;
            Fm[6, 8] = 0.71;
            Fm[7, 8] = 0.80;
            Fm[8, 8] = 0.54;
            Fm[9, 8] = 0.63;
            Fm[10, 8] = 0.52;
            Fm[11, 8] = 0.63;
            Fm[12, 8] = 0.57;
            Fm[13, 8] = 0.57;


            InitializeComponent();
        }
       
    }
}
